---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ScheduleEmbeddedParam
source: html/657b7ede-d870-36f9-39c7-20b1063d147d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ScheduleEmbeddedParam Property

"Embedded Schedule"

## Syntax (C#)
```csharp
public static ForgeTypeId ScheduleEmbeddedParam { get; }
```